{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Root","n":1},"1":{"v":"# Notes\n\nJust trying out dendron for the first time. \nAlso I realized I'm slowly becoming a nerd now so I guess blogs/ notes/ journals are a good place to start.\nPlease feel free to provide feedback and suggestions [here](mailto:vijaya2798@gmail.com).\n\n## Connect me here\n\nAlso checkout my other profiles here - \n - [Twitter](https://twitter.com/vijaya2296)\n - [Github](https://github.com/vijaya22)\n - [LinkedIn](https://www.linkedin.com/in/vijayalaxmi166/)\n","n":0.136}}},{"i":2,"$":{"0":{"v":"Meet","n":1}}},{"i":3,"$":{"0":{"v":"2022","n":1}}},{"i":4,"$":{"0":{"v":"06","n":1}}},{"i":5,"$":{"0":{"v":"02","n":1},"1":{"v":"\nMeeting's takeaways\n\n## Attendees\n\n- @Vijaya\n\n## Goals\n\nTo retain the learnings from each meeting.\n\n## Agenda\n\nJot down takeaways from Standups/ Retro/ Planning\n\n## Action Items\n\n- Be Proactive\n- Express yourself\n- Be open to new ideas\n\n## Tech Takeaways\n","n":0.18}}},{"i":6,"$":{"0":{"v":"Dendron","n":1}}},{"i":7,"$":{"0":{"v":"Templates","n":1}}},{"i":8,"$":{"0":{"v":"Meeting Notes Template","n":0.577},"1":{"v":"_Edit the [[dendron.templates.meet]] to change this template generated for Dendron Meeting Notes._\n\n## Attendees\n<!-- Meeting attendees. If you prefix users with an '@', you can then optionally click Ctrl+Enter to create a note for that user. -->\n\n- @JohnDoe\n\n## Goals\n<!-- Main objectives of the meeting -->\n\n## Agenda\n<!-- Agenda to be covered in the meeting -->\n\n## Minutes\n<!-- Notes of discussion occurring during the meeting -->\n\n## Action Items\n<!-- You can add any follow up items here. If they require more detail, you can use `Create Task Note` to create each follow up item as a separate note. -->\n\n- Follow Up Task 1\n- Follow Up Task 2\n","n":0.099}}},{"i":9,"$":{"0":{"v":"Things 2023","n":0.707},"1":{"v":"# Things 2023\n\nI am planning to jot down all the highlights of the year 2023.\n\nThe idea to collect all the good things in the year 2022 was really great. So what I am planning to do this year is to collect something to write in a few weeks.\n\nAlso, I hope that quillbot someday works on VS code as well as I write my notes here :( .","n":0.122}}},{"i":10,"$":{"0":{"v":"Running","n":1},"1":{"v":"\n# Running\n\nRunning is as we know is the best cardio. And also I ran 200 kms in the year 2022.\nSo now I plan to run to 1100 kms in the year 2023, approximately 100kms per month. This will definitely bring my resting heart rate down and increase my fitness level.\n\nHere's a screenshot of my 2022 run summary. ;)\n\n![Strava](/assets/images/StravaHistory.jpg){width: 300px, height: 300px}\n\n\n","n":0.128}}},{"i":11,"$":{"0":{"v":"Home Coming","n":0.707},"1":{"v":"# Home Coming\n\nOkay so Param Singh is coming back to India finally.  Yayyyyyy!!!! :D","n":0.267}}},{"i":12,"$":{"0":{"v":"GOA Workation","n":0.707},"1":{"v":"\n# Goa Workation\n\nThe workation in Goa was great. We had so much fun. I met a lot of new people, made new friends and obviuosly the extension peeps.\n\nThe extension gang and the beach drinks, late night games by the pool were all so amazing. I wish we met and had fun like this every now and then. \n\nWe went to paintball which was so fun. Then we went to Thalassa which was also amazing and on the way down, it was Mayday, ie. the leads went down. ;)\nWe also went to North goa - Baga beach , went to the beach clicked some great pictures and had some drinks. We also had fish pedicures. It was so fun. I was so scared at first but you know everyone was. It really was the highlight.\n\nIt was really an amazing trip.\n\n![Goa](/assets/images/GoaBeach.jpg){width: 300px, height: 300px}","n":0.084}}},{"i":13,"$":{"0":{"v":"Cancer","n":1},"1":{"v":"# Cancer\n\nOkay this may sound weird. But this is also something I have seen lately in the people around me. \nIt is painful to see people you love suffering. Its just Feburary end and a lot has happened.\n\nAlso the hopsitals in our country really needs some serious attention especially in Uttar Pradesh. :(","n":0.137}}},{"i":14,"$":{"0":{"v":"Takiyasu Aritesis","n":0.707},"1":{"v":"\nTakiyasu Aritesis is a rare medical condition in which inflammation damages large and medium-sized arteries.\n\nSomething I have been seeing in people close to me. \n","n":0.2}}},{"i":15,"$":{"0":{"v":"NewThingytolearn","n":1},"1":{"v":"\n- React docs\n\n- RxJS\n\n- React Hydration\n\n- Redux\n\n- Serialization and Deserialization\n\n- Redux Saga https://redux-saga.js.org/\n\n- Re-reselect: https://github.com/toomuchdesign/re-reselect\n\n- Redux in Electron using IPC: https://github.com/klarna/electron-redux\n\n- Proxy memoize \n\n- Proxy memoize vs Re-reselect (which is better)\n","n":0.18}}},{"i":16,"$":{"0":{"v":"Serialization Deserialization","n":0.707},"1":{"v":"\nSerialization\n\nSerialization converts an in-memory data structure to a value that can be stored or transferred. For example, In Javascript, we can serialize the usersObject by passing it into the JSON.stringify() function.\n\nDeserialization\n\nThe conversion from serialized string to an in-memory data structure is deserialization. We can accomplish this with the JavaScript JSON.parse() function.\n","n":0.14}}},{"i":17,"$":{"0":{"v":"Redux","n":1},"1":{"v":"\nWhat is Redux ?\n\nRedux is a pattern and library for managing and updating application state, using events called \"actions\". \n\nIt serves as a centralized store for state that needs to be used across your entire application, with rules ensuring that the state can only be updated in a predictable fashion.\n\nRedux is normally used by installing the Redux packages from NPM, and the UI is created using a library like React.\n\nWhen should I use Redux?\n\nRedux is more useful when:\n\n- You have large amounts of application state that are needed in many places in the app\n- The app state is updated frequently over time\n- The logic to update that state may be complex\n- The app has a medium or large-sized codebase, and might be worked on by many people\n\nRedux Libraries and Tools\n\n- React-Redux\n    React-Redux is the official package that lets React components interact with a Redux store by reading pieces of state and dispatching actions to update the store.\n\n- Redux Toolkit\n    Used for writing Redux Logic. It contains packages and functions that are essential for building a Redux app.\n    \n- Redux DevTools Extension\n    This allows to debug applications effectively.\n\n\nThe Redux Store\n- The center of every Redux application is the store. \n\n- A \"store\" is a container that holds your application's global state.\n\n- A store is a JavaScript object with a few special functions and abilities that make it different than a plain global object\n\n\n","n":0.066}}},{"i":18,"$":{"0":{"v":"Meetings take aways","n":0.577},"1":{"v":"\n\nKrishna's Takeaway\n -> Proactiveness\n -> Nail your given task\n -> Try to learn the technology\n -> Become master of chrome extensions\n\n\n\n\n\n\n          ","n":0.218}}},{"i":19,"$":{"0":{"v":"All Good Things","n":0.577},"1":{"v":"\n# All the good things\n\nThe goal is to find the best thing that happenend in the week and write it down. \n\nAlso right now, they are not in order as I can't figure out how to do that.\n","n":0.162}}},{"i":20,"$":{"0":{"v":"Workation","n":1},"1":{"v":"\nOKAYYYYYYY!!!!!!\n\nI literally have such good feelings for Quillbot now. I'm so happy. This whole had been so great. Workations are great especially this one as it was my first workation at Quillbot. I made so many new friends. This whole week was amazing. <3\n\nP.S.: Now I feel Goa is a place I can live at.\n\n![Goa](/assets/images/Goa.jpeg){width: 300px, height: 500px}\n","n":0.131}}},{"i":21,"$":{"0":{"v":"SupremeS","n":1},"1":{"v":"\nThis whole week has been kind a good week. I watched Euphoria and listened to songs with supremeS happiness. ;)\n","n":0.224}}},{"i":22,"$":{"0":{"v":"Start of the year","n":0.5},"1":{"v":"\nMy mom made cheescake for my father's birthday. It was the best thing ever.\n\n\n![My mom's cheesecake](/assets/images/cake.png){width: 400px}\n\n","n":0.243}}},{"i":23,"$":{"0":{"v":"Something's happening","n":0.707},"1":{"v":"\nSo I'm officially into running. I completed my first 5k.\n\n![Running Ground](/assets/images/running.jpg){width: 500px, height: 200px}\n\n\n\n\n","n":0.267}}},{"i":24,"$":{"0":{"v":"Running","n":1},"1":{"v":"\nI started running. And yes I started using dendron & github co-pilot.\n\n","n":0.289}}},{"i":25,"$":{"0":{"v":"Quillbot","n":1},"1":{"v":"\nI joined Quillbot.\n","n":0.577}}},{"i":26,"$":{"0":{"v":"Netflix and chill","n":0.577},"1":{"v":"\nSo [my boyfriend](https://twitter.com/iliekcomputers) and I started watching a series toegther - Emily in Paris.\nHe is the Aiesha for me. :D\n","n":0.224}}},{"i":27,"$":{"0":{"v":"Movie Night","n":0.707},"1":{"v":"\nSo [my boyfriend](https://twitter.com/iliekcomputers) and I watched a movie together - Wake up Sid.\n\nAlso between us, I think he is the Aiesha. :D\n","n":0.213}}},{"i":28,"$":{"0":{"v":"MissingHomeAtHome","n":1},"1":{"v":"\nThis was my last week at home (for now). Everyone at home is a little sad.\nMy mom made my favorite cinnamon bread. I miss home.\n","n":0.2}}},{"i":29,"$":{"0":{"v":"MIND","n":1},"1":{"v":"Okay, so the best day was the last day at MIND. I even got a small internal farewell by Aditya sir, Hitesh sir & Gurbaaz. Ashna and Anshu even put stories for me. Sonia mam, Stuthi, Ashna, Manisha, Param, Kartikeya made it really special. Also my sister made cake for me and my parents celebrated my farewell.\n\n\n\n","n":0.132}}},{"i":30,"$":{"0":{"v":"Ludo Nights","n":0.707},"1":{"v":"\nSo my parents are in town and because of that I am too busy these days. But [my boyfriend](https://twitter.com/iliekcomputers) and I found a way to spend some time together. So we play Ludo every night. It is the best part of my day.\n","n":0.152}}},{"i":31,"$":{"0":{"v":"Long Distance Date Night","n":0.5},"1":{"v":"\nSo its basically June 2nd, 2022. And [my boyfriend](https://twitter.com/iliekcomputers) has gone back to Dublin. So officially, we are in a LDR (long distance relationship). I won't say its bad. But obviously, I miss him being around. ;)\n\nBut enough of that. What we are doing now adays is have our date nights or if I say my boyfriend's date lunch. So we sit together once a week to eat and talk and also play some games. Its actually quite fun.\n","n":0.113}}},{"i":32,"$":{"0":{"v":"It is Successful","n":0.577},"1":{"v":"\nSo my father had to go through operation for some reason. But as he has many complications in his body, it is very dangerous for him to go through even a small one. But this time he had gone through one of it successfully. \n","n":0.149}}},{"i":33,"$":{"0":{"v":"Dough Maker","n":0.707},"1":{"v":"\nSo this week I got my mom a dough maker. Basically, you put in the ingredients and it makes the dough. I guess it would help my mom a lot.\n\n![Dough Maker](/assets/images/dough-maker.jpg){width: 300px, height: 300px}\n\n\nAlso, I got my account for quillbot. I'm pretty nervous. \n","n":0.151}}},{"i":34,"$":{"0":{"v":"Date Night","n":0.707},"1":{"v":"\nThis week has been a dreamy sequence. A lot of things happened this week, but I'm still choosing this as my favourite one.\n\nSo I and [my boyfriend](https://twitter.com/iliekcomputers) went on our first official date night on 17th March. After this I can say, date nights are the best.\n\n![Date Night](/assets/images/Datenight.jpg)\n\nAlso I'm attaching one of favourite things from this week.\n\n![Date Night](/assets/images/Gifts.jpg)\n","n":0.131}}},{"i":35,"$":{"0":{"v":"Chicken","n":1},"1":{"v":"\nThere were a lot of good things that happened this week. One of them would I cooked chicken for the first time in my life (chicken 65). Also I talked to my friends Stuthi, Sachin sir & Jawa sir after long time, so I guess it was fun. One more, my sister got called for an interview - will reveal later.\n\n![Chicken 65](/assets/images/chicken.jpg){width: 300px, height: 300px}","n":0.124}}}]}
